frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l4/include/component/aesa.h
/**
 * \file
 *
 * \brief Component description for AESA
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_AESA_COMPONENT_
#define _SAM4L_AESA_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR AESA */
/* ========================================================================== */
/** \addtogroup SAM4L_AESA Advanced Encryption Standard */
/*@{*/

#define AESA_I7558
#define REV_AESA                    0x102

/* -------- AESA_CTRL : (AESA Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ENABLE:1;         /*!< bit:      0  Enable Module                      */
    uint32_t DKEYGEN:1;        /*!< bit:      1  Decryption Key Generate            */
    uint32_t NEWMSG:1;         /*!< bit:      2  New Message                        */
    uint32_t :5;               /*!< bit:  3.. 7  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:      8  Software Reset                     */
    uint32_t :23;              /*!< bit:  9..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_CTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_CTRL_OFFSET            0x00         /**< \brief (AESA_CTRL offset) Control Register */
#define AESA_CTRL_RESETVALUE        _U(0x00000000); /**< \brief (AESA_CTRL reset_value) Control Register */

#define AESA_CTRL_ENABLE_Pos        0            /**< \brief (AESA_CTRL) Enable Module */
#define AESA_CTRL_ENABLE            (_U(0x1) << AESA_CTRL_ENABLE_Pos)
#define AESA_CTRL_DKEYGEN_Pos       1            /**< \brief (AESA_CTRL) Decryption Key Generate */
#define AESA_CTRL_DKEYGEN           (_U(0x1) << AESA_CTRL_DKEYGEN_Pos)
#define AESA_CTRL_NEWMSG_Pos        2            /**< \brief (AESA_CTRL) New Message */
#define AESA_CTRL_NEWMSG            (_U(0x1) << AESA_CTRL_NEWMSG_Pos)
#define AESA_CTRL_SWRST_Pos         8            /**< \brief (AESA_CTRL) Software Reset */
#define AESA_CTRL_SWRST             (_U(0x1) << AESA_CTRL_SWRST_Pos)
#define AESA_CTRL_MASK              _U(0x00000107) /**< \brief (AESA_CTRL) MASK Register */

/* -------- AESA_MODE : (AESA Offset: 0x04) (R/W 32) Mode Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t ENCRYPT:1;        /*!< bit:      0  Encryption                         */
    uint32_t KEYSIZE:2;        /*!< bit:  1.. 2  Key Size                           */
    uint32_t DMA:1;            /*!< bit:      3  DMA Mode                           */
    uint32_t OPMODE:3;         /*!< bit:  4.. 6  Confidentiality Mode of Operation  */
    uint32_t :1;               /*!< bit:      7  Reserved                           */
    uint32_t CFBS:3;           /*!< bit:  8..10  Cipher Feedback Data Segment Size  */
    uint32_t :5;               /*!< bit: 11..15  Reserved                           */
    uint32_t CTYPE:4;          /*!< bit: 16..19  Countermeasure Type                */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} AESA_MODE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define AESA_MODE_OFFSET            0x04         /**< \brief (AESA_MODE offset) Mode Register */
#define AESA_MODE_RESETVALUE        _U(0x000F0000); /**< \brief (AESA_MODE reset_value) Mode Register */

#define AESA_MODE_ENCRYPT_Pos       0            /**< \brief (AESA_MODE) Encryption */
#define AESA_MODE_ENCRYPT           (_U(0x1) << AESA_MODE_ENCRYPT_Pos)
#define AESA_MODE_KEYSIZE_Pos       1            /**< \brief (AESA_MODE) Key Size */
#define AESA_MODE_KEYSIZE_Msk       (_U(0x3) << AESA_MODE_KEYSIZE_Pos)
#define AESA_MODE_KEYSIZE(value)    (AESA_MODE_KEYSIZE_Msk & ((value) << AESA_MODE_KEYSIZE_Pos))
#define AESA_MODE_DMA_Pos           3            /**< \brief (AESA_MODE) DMA Mode */
#define AESA_MODE_DMA               (_U(0x1) << AESA_MODE_DMA_Pos)
#define AESA_MODE_OPMODE_Pos        4            /**< \brief (AESA_MODE) Confidentiality Mode of Operation */
#define AESA_MODE_OPMODE_Msk        (_U(0x7) << AESA_MODE_OPMODE_Pos)
#define AESA_MODE_OPMODE(value)     (AESA_MODE_OPMODE_Msk & ((value) << AESA_MODE_OPMODE_Pos))
#define AESA_MODE_CFBS_Pos          8            /**< \brief (AESA_MODE) Cipher Feedback Data Segment Size */
#define AESA_MODE_CFBS_Msk          (_U(0x7) << AESA_MODE_CFBS_Pos)
#define AESA_MODE_CFBS(value)       (AESA_MODE_CFBS_Msk & ((value) << AESA_MODE_CFBS_Pos))
#define AESA_MODE_CTYPE_Pos         16           /**< \brief (AESA_MODE) Countermeasure Type */
#define AESA_MODE_CTYPE_Msk         (_U(0xF) << AESA_MODE_CTYPE_Pos)
#define AESA_MODE_CTYPE(value)      (AESA_MODE_CTYPE_Msk & ((value) << AESA_MODE_CTYPE_Pos))
#define AESA_MODE_MASK              _U(0x000F077F) /**< \brief (AESA_MODE) MASK Register */

